<a href="https://colab.research.google.com/github/anakhabose/Learn.py/blob/main/TASK_21.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

1.  Using the dataset given below,
  - Group the given dataset by A and find the sum of the groups.
  - Find the 3 least elements from the column D
  - Find the 3 largest elements from the Column D which belongs to the group
  'bar'.

In [26]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar',
                          'foo', 'bar', 'foo', 'foo'],
                   'B' : ['one', 'one', 'two', 'three',
                          'two', 'two', 'one', 'three'],
                   'C' : np.random.randn(8),
                   'D' : np.random.randn(8)})
df
#please type your code below this line.

     A      B         C         D
0  foo    one -0.144393  0.126375
1  bar    one -0.250087 -0.279182
2  foo    two  0.938758 -0.696252
3  bar  three -2.634665  0.557023
4  foo    two  0.812026  0.213835
5  bar    two -0.379890 -0.388747
6  foo    one -1.698368  0.458530
7  foo  three  0.713443 -0.899142

In [31]:
#groupby A and sum
df.groupby('A').sum()

            C         D
A
bar -3.264643 -0.110905
foo  0.621465 -0.796654

In [32]:
#least 3 from D
df['D'].nsmallest(3)

7   -0.899142
2   -0.696252
5   -0.388747
Name: D, dtype: float64

In [65]:
#3 largest-D-bar
x = df.groupby('A')
y = x.get_group('bar')
y['D'].nlargest(3)

3    0.557023
1   -0.279182
5   -0.388747
Name: D, dtype: float64

2. Using the dataset given below,
  - convert the dataset into a csv file.
  - read the csv file just saved
  - covert the dataset into a excel file.
  - read the excel file just saved.

In [6]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar',
                          'foo', 'bar', 'foo', 'foo'],
                   'B' : ['one', 'one', 'two', 'three',
                          'two', 'two', 'one', 'three'],
                   'C' : np.random.randn(8),
                   'D' : np.random.randn(8)})
#please type your code below this line.

In [63]:
#convert to csv file
df.to_csv('data.csv')
#read the csv file just saved
a = pd.read_csv('data.csv')
a

   Unnamed: 0    A      B         C         D
0           0  foo    one -0.144393  0.126375
1           1  bar    one -0.250087 -0.279182
2           2  foo    two  0.938758 -0.696252
3           3  bar  three -2.634665  0.557023
4           4  foo    two  0.812026  0.213835
5           5  bar    two -0.379890 -0.388747
6           6  foo    one -1.698368  0.458530
7           7  foo  three  0.713443 -0.899142

In [64]:
#convert the dataset into excel file
df.to_excel("output.xlsx")
#read the excel just saved
b = pd.read_excel("output.xlsx")
b

   Unnamed: 0    A      B         C         D
0           0  foo    one -0.144393  0.126375
1           1  bar    one -0.250087 -0.279182
2           2  foo    two  0.938758 -0.696252
3           3  bar  three -2.634665  0.557023
4           4  foo    two  0.812026  0.213835
5           5  bar    two -0.379890 -0.388747
6           6  foo    one -1.698368  0.458530
7           7  foo  three  0.713443 -0.899142